---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewBuildingShellMode
source: html/be7f9e2d-730f-9c52-bd96-0fc18d8d5ae3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewBuildingShellMode Property

"Show Analytical Building Shell"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisViewBuildingShellMode { get; }
```